### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cosmosdb_sql_role_assignment.test-app-cdb-rbac will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "test-app-cdb-rbac" {
      + account_name        = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "faspo-poc-data-rg"
      + role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb"
    }

  # azurerm_federated_identity_credential.test-app-uami-fc will be created
  + resource "azurerm_federated_identity_credential" "test-app-uami-fc" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://germanywestcentral.oic.prod-aks.azure.com/d46035c4-e4ae-4ea6-904f-6f343b7b5673/08ce482c-a53d-4603-9323-eafac0a453d2/"
      + name                = "faspo-poc-test-app-uami-fc"
      + parent_id           = (known after apply)
      + resource_group_name = "faspo-poc-sec-rg"
      + subject             = "system:serviceaccount:default:faspo-poc-test-app-sa"
    }

  # azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-comp-rg/providers/Microsoft.ContainerService/managedClusters/faspo-poc-aks"
        name                                = "faspo-poc-aks"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
          ~ vm_size                       = "Standard_DS2_v2" -> "Standard_B2pls_v2"
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.test-app-uami will be created
  + resource "azurerm_user_assigned_identity" "test-app-uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "faspo-poc-test-app-uami"
      + principal_id        = (known after apply)
      + resource_group_name = "faspo-poc-sec-rg"
      + tenant_id           = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
